Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/loans_and_credit/overdrafts.html.txt.tmx
Source language: en
Languages: ga

source: An overdraft is an additional amount of money that can be drawn from a current account when it is in debit
ga: Is suim bhreise airgid í rótharraingt gur féidir a aistharraingt as cuntas reatha nuair atá iarmhéid dochair ann (is é sin a rá, méid breise airgid tógtha as do chuntas bainc agus é faoi nialas)

source: (In other words, an additional amount of money drawn from your account when it is below zero)
ga: Is áis ghearrthéarmach í a úsáidtear de ghnáth chun sreabhadh airgid thirim a mhéadú go sealadach

source: Overdrafts are generally a short-term facility used to temporarily increase cashflow and allows you to spend more than you have in your current account
ga: Dá bharr, d'fhéadfá níos mó airgid a chaitheamh ná mar atá i do chuntas reatha

source: Although interest rates on an overdraft can be high, you only pay interest on the amount you use
ga: Cé go bhféadfadh rátaí úis ar rótharraingt a bheith ard, ní íoctar ús ach ar an méid airgid a aistharraingítear

source: If your current account has regular incomings and outgoings, then a bank will usually grant you an overdraft
ga: De ghnáth ceadóidh banc rótharraingt do chustaiméir má bhíonn bearta isteach agus amach go rialta

source: If money going into an account is withdrawn almost immediately and is not held in the account for any significant amount of time, then the bank might not grant an overdraft as it could see this as an inability to repay
ga: Más amhlaidh atá airgead á thógáil amach as cuntas láithreach tar éis dó a bheith curtha isteach agus nach bhfuil airgead á choinneáil sa chuntas ar feadh tréimhse suntasaí, d'fhéadfadh an banc a bheith den tuairim gur comhartha é seo nach bhféadfar é a aisíoc. Sa chás sin d'fhéadfadh sé rótharraingt a dhiúltú

source: • Overdrafts are available on current accounts only
ga: • Ní bhíonn rótharraingt ar fáil ach amháin ar chuntas reatha

source: • Overdraft facilities are provided at the discretion of your financial institution
ga: • Soláthraítear áiseanna rótharraingthe faoi lánrogha d’institiúide airgeadais

source: • An overdraft and the amount that will be granted to you in the form of an overdraft, in most cases, depends on the history of transactions in the current account
ga: • Braitheann rótharraingt agus an méid a dheonófar duit i bhfoirm rótharraingthe, i dtromlach na gcásanna, ar stair na n-idirbheart sa chuntas reatha

source: If you have a bad credit history, you may find it difficult to obtain an overdraft
ga: Má tá drochstair creidmheasa agat, b’fhéidir go mbeidh sé deacair ort rótharraingt a fháil

source: • You pay back the amount overdrawn when the funds become available in the account
ga: • Aisíocann an tomhaltóir an tsuim rótharraingthe agus ús ar an tsuim rótharraingthe nuair a bhíonn airgead ar fáil sa chuntas

source: • Overdrafts can be temporary or permanent
ga: • D'fhéadfadh rótharraingt a bheith sealadach nó buan

source: If you are having difficulty paying back an overdraft
ga: Má tá deacrachtaí agat rótharraingt a aisíoc

source: If you are having difficulty paying back an overdraft, you can ask for a time extension from the bank
ga: Má tá deacrachtaí agat rótharraingt a aisíoc, d'fhéadfá síneadh ama a iarraidh ar an mbanc

source: This will be granted if your payment history is satisfactory
ga: Ceadófar é sin má tá stair d'íocaíochtaí sásúil

source: If you continue to experience difficulty in paying pack the overdraft and are getting further and further into debt, you can contact the Money Advice and Budgeting Service (MABS)
ga: Má tá deacrachtaí leanúnacha agat agus tú ag aisíoc na rótharraingte agus má tá do chuid fiacha ag méadú dá bharr, d'fhéadfá dul i dteagmháil leis an tSeirbhís Bhuiseadaithe agus Chomhairle Airgid (MABS)

source: MABS will work with you to establish how much money you can afford to pay back per month
ga: Rachaidh MABS seo i gcomhairle leat agus socróidh siad an méid airgid gur féidir leat a aisíoc in aghaidh na míosa

source: It will then contact the bank directly on your behalf
ga: Rachaidh sí i dteagmháil leis an mbanc ar do shon

source: MABS will arrange with the bank for you to pay back a certain amount every month until the overdraft decreases and the debt is cleared
ga: Socróidh MABS leis an mbanc go n-aisíocfaidh tú suim áirithe gach mí go dtí go laghdófar an rótharraingt agus go nglanfar na fiacha

source: MABS offers this service free of charge
ga: Cuireann MABS an tseirbhís seo ar fáil saor in aisce

source: Many banks charge a fee for setting up an overdraft and there is usually an annual fee (called a renewal fee) for an overdraft facility
ga: Gearrann go leor banc táille ar rótharraingt a shocrú agus is gnách go ngearrtar táille bhliantúil (ar a dtugtar táille athnuachana) ar áis rótharraingthe

source: The amount that an account can be overdrawn (overdraft limit) is agreed in advance between the current account holder and the financial institution
ga: Déantar comhaontú ar an méid is féidir cuntas a rótharraingt (teorainn rótharraingthe) roimh ré idir sealbhóir an chuntais agus an institiúid airgeadais

source: You pay interest on the amount you owe at any one time, not on the total overdraft limit available to you
ga: Íocann tú ús ar an méid atá le híoc agat ag aon tráth amháin, seachas ar an teorainn iomlán rótharraingthe atá ar fáil agat

source: The interest rate on overdrafts is usually a little higher than the rate charged on personal loans and can range from about 11% to about 15% depending on your bank
ga: Is gnách go mbíonn an ráta úis ar rótharraingtí beagán níos airde ná an ráta a ghearrtar ar iasachtaí pearsanta agus gur féidir thart ar idir 11% agus 15% a bheith i gceist leo, ag brath ar do bhanc

source: If you go over your agreed overdraft limit surcharge interest can be charged
ga: Má sháraíonn tú do theorainn chomhaontaithe rótharraingthe, féadtar ús a ghearradh

source: You should contact your bank or building society if you wish to find out about overdraft facilities
ga: Ba cheart duit teagmháil a dhéanamh le do bhanc nó do chumann foirgníochta más mian leat faisnéis a fháil faoi áiseanna rótharraingthe

source: Applying for an overdraft includes filling out a form and can also involve meeting with the financial institution's officials
ga: Is éard a bhíonn i gceist le hiarratas a dhéanamh ar rótharraingt ná foirm a chomhlánú agus d’fhéadfadh cruinniú le hoifigigh na hinstitiúide airgeadais a bheith i gceist leis, chomh maith

source: Some institutions have 24-hour help lines that take applications over the phone
ga: Bíonn línte cabhrach 24 uair an chloig ag roinnt institiúidí a ghlacann le hiarratais thar an nguthán

source: Some institutions also have web sites where applications can be made online
ga: Tá láithreáin ghréasáin ag roinnt institiúidí, chomh maith, áit ar féidir le hiarratais a dhéanamh ar líne
